In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, LabelEncoder, OneHotEncoder
import pickle

In [25]:
data = pd.read_csv('Churn_Modelling.csv')
data.sample(5)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
1751,1752,15632256,Schroeder,541,France,Male,29,7,127504.57,1,0,0,86173.92,0
5933,5934,15594340,Tao,569,France,Male,41,4,120243.49,1,1,0,163150.03,1
7495,7496,15589541,Sutherland,557,France,Female,27,2,0.00,2,0,1,4497.55,0
9901,9902,15802909,Hu,706,Germany,Female,56,3,139603.22,1,1,1,86383.61,0
3883,3884,15604355,Shand,519,France,Male,39,1,97700.02,1,1,1,30709.03,0

In [26]:
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [16]:
## Preprocessing the data
data.drop(columns=['RowNumber', 'CustomerId', 'Surname'], axis=1, inplace=True)

data.sample(5)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9985,659,France,Male,36,6,123841.49,2,1,0,96833.00,0
8115,545,France,Female,32,6,0.00,2,1,1,52067.37,0
4096,820,Spain,Male,34,10,97208.46,1,1,1,59553.34,0
205,550,France,Male,37,3,0.00,1,1,1,179670.31,0
5280,569,Germany,Female,28,3,100032.52,1,1,0,5159.21,1

In [17]:
import tensorflow as tf

In [18]:
label_encoder_gender = LabelEncoder()

data['Gender'] = label_encoder_gender.fit_transform(data['Gender'])

In [19]:
ohe_geo = OneHotEncoder(handle_unknown='ignore')
geo_encoded = ohe_geo.fit_transform(data[['Geography']]).toarray()
geo_encoded_df = pd.DataFrame(geo_encoded, columns=ohe_geo.get_feature_names_out(['Geography']))

In [20]:
data = pd.concat([data.drop(columns=['Geography'],axis = 1), geo_encoded_df ])

In [21]:
data.head(7)

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain
0,619.0,0.0,42.0,2.0,0.00,1.0,1.0,1.0,101348.88,1.0,NaN,NaN,NaN
1,608.0,0.0,41.0,1.0,83807.86,1.0,0.0,1.0,112542.58,0.0,NaN,NaN,NaN
2,502.0,0.0,42.0,8.0,159660.80,3.0,1.0,0.0,113931.57,1.0,NaN,NaN,NaN
3,699.0,0.0,39.0,1.0,0.00,2.0,0.0,0.0,93826.63,0.0,NaN,NaN,NaN
4,850.0,0.0,43.0,2.0,125510.82,1.0,1.0,1.0,79084.10,0.0,NaN,NaN,NaN
5,645.0,1.0,44.0,8.0,113755.78,2.0,1.0,0.0,149756.71,1.0,NaN,NaN,NaN
6,822.0,1.0,50.0,7.0,0.00,2.0,1.0,1.0,10062.80,0.0,NaN,NaN,NaN

In [22]:
## Split the data into features and target

X = data.drop(columns=['EstimatedSalary'], axis=1)
y = data['EstimatedSalary']

In [23]:
with open('label_encoder_gender.pkl', 'wb') as file:
    pickle.dump(label_encoder_gender, file)

In [24]:
x = 1;
sum = x;

for i in range(31):
    sum += x;
    x *= 2;

sum

2147483648